jangle/app/controllers/application_controller.rb

  def current_user
    # @current_user ||= User.find_by_session_token(session[:session_token])
    User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "OMK7rmkMFCQUrFq4bCFZbw"], ["LIMIT", 1]]